{
  "token": "токен бота получается у BotFather",
  "questions": [
    {
      "name": null,
      "query": "Следующие данные будут использованы при печати грамот и дипломов, а также передаче информации в Российский совет олимпиад школьников о призерах и победителях олимпиады. При проверке работы указанная информация не учитывается.",
      "skip": false,
      "choice": [
        "Начать"
      ]
    },
    {
      "name": "Код",
      "query": "Код региона, в котором находится школа, в соответствии с Конституцией РФ. Например, Санкт-Петербург - 78, Москва - 77, Ленинградская область - 47. Обучающиеся за пределами России указывают код 100.",
      "skip": false,
      "choice": []
    },
    {
      "name": "Населенный пункт",
      "query": "Пожалуйста, укажите название населенного пункта, в котором находится Ваша школа.",
      "skip": false,
      "choice": []
    },
    {
      "name": "Школа",
      "query": "Краткое название, принятое в Вашем регионе или номер образовательного учреждения. Например, ГФМЛ 30, ПФМЛ 239, ЮМШ, КФМЛ, СУНЦ МГУ,...",
      "skip": false,
      "choice": []
    },
    {
      "name": "Полное название",
      "query": "Запишите название так, как оно должно быть указано в дипломах, грамотах,... Например: ГБОУ лицей № 533 Красногвардейского района Санкт-Петербурга.",
      "skip": false,
      "choice": []
    },
    {
      "name": "Класс",
      "query": "Класс обучения, включая букву. Например 4а, 5-1, 10аш",
      "skip": false,
      "choice": []
    },
    {
      "name": "Я проживаю",
      "query": "Я проживаю",
      "skip": false,
      "choice": [
        "В сельской местности",
        "В городе"
      ]
    },
    {
      "name": "ОВЗ",
      "query": "Укажите тип ОВЗ(по зрению, слуху,...), если вы относитесь к участникам с ограниченными возможностями здоровья",
      "skip": true,
      "choice": []
    },
    {
      "name": null,
      "query": "Согласен н аобработку персональных данных\nЯ подтверждаю, что введенные мной персональные и прочие данные соответствуют действительности; соглашаюсь с тем, что ознакомлен с порядком, условиями и требованиями по проведению олимпиады в соответствии с Положением и Регламентом олимпиады; соглашаюсь на сбор, хранение, обезличивание, уничтожение, использование, распространение (передачу) Организаторами олимпиады моих персональных данных; соглашаюсь на открытую публикацию своих фамилии, имени, отчества, места учебы, а также полученных в результате выполнения заданий результатов и протокола олимпиады, в том числе на открытую публикацию в сети Интернет этих данных;  соглашаюсь на публикацию в сети Интернет моей олимпиадной работы в обезличенном виде; соглашаюсь на получение по электронной почте уведомлений о событиях, связанных с олимпиадой ЮМШ. Данное согласие действует до 31 декабря 2025 года. \nЗамечание: в случае, если участник олимпиады несовершеннолетний, согласие дает родитель (законный представитель) участника.",
      "skip": false,
      "choice": [
        "Да"
      ]
    },
    {
      "name": "Фамилия",
      "query": "Фамилия",
      "skip": false,
      "choice": []
    },
    {
      "name": "Имя",
      "query": "Пожалуйста, укажите, полное имя. Например, Иван (а не Ваня), Александра (а не Саша).",
      "skip": false,
      "choice": []
    },
    {
      "name": "Отчество",
      "query": "Введите отчество. Если у Вас нет отчества, пропустите",
      "skip": true,
      "choice": []
    },
    {
      "name": "Пар",
      "query": "Введите параллель участия",
      "skip": false,
      "choice": [
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11"
      ]
    },
    {
      "name": "Email",
      "query": "Введите Email",
      "skip": false,
      "choice": []
    },
    {
      "name": "Телефон",
      "query": "Введите телефон для оперативной связи",
      "skip": true,
      "choice": []
    },
    {
      "name": null,
      "query": "Второй дистанционный тур проходит 5 октября 2024 г. с 16.00 до 21.00 по московскому времени.\nУсловия публикуются на сайте ЮМШ: http://yumsh.ru/cms/node/374\n\nОлимпиадную работу можно оформить одним из трех способов:\nа) Написать на бумаге, а затем отсканировать или сфотографировать. Нельзя сканировать или фотографировать работы поперёк текста или вверх ногами. Перед отправкой проверьте, что все сканы/фото ориентированы правильно и нормально читаются. При необходимости отсканируйте или сфотографируйте соответствующие страницы заново.\nб) Набрать в текстовом редакторе.\nв) Написать решения на графическом планшете и сохранить в pdf файл.\nУсловия задач в работу переписывать не нужно.\n\nОбратите внимание, что требуются полные решения (а не только ответы)!\n\nРаботы, отправленные после окончания тура, не рассматриваются. В случае сдачи нескольких работ оценивается последняя сданная работа, а остальные не рассматриваются.",
      "skip": false,
      "choice": [
        "Далее"
      ]
    }
  ],
  "ask_files_message": "Вы можете прикрепить до 20 файлов общим объемом до 18 Мб.\nДопустимые форматы файлов: pdf, jpg, jpeg, doc, docx, odf.\nВ случае успешной сдачи работы Вы увидите соответствующее сообщение, а на указанный Вами адрес электронной почты придет подтверждение. После ввода всех файлов напишите любое сообщение",
  "check_message": "Я проверил, что все нужные файлы успешно загружены. \nПредупрежден, что после отправки работы проверить это будет невозможно, копии загруженных файлов не рассылаются, обращения и звонки с просьбой проверить качество загрузки - не обрабатываются.",
  "last_message": "Ваша работа принята.\n\nРезультаты тура будут опубликованы на сайте ЮМШ не позже 20.00 в пятницу, 1 ноября 2024 года.\n\nОбращаем внимание, что обращения с просьбой проверить качество и правильность загрузки файлов, отправки дополнительного подтверждения сдачи работы, досрочной проверкой работы и т.д. не обрабатываются.",
  "file_types": [
    "pdf",
    "jpeg",
    "jpg",
    "doc",
    "docx",
    "odf"
  ]
}